backend/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "date", "frequency", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Water"], ["date", "2021-10-03"], ["frequency", "1 days"], ["status", "active"], ["created_at", "2021-10-03 23:24:40.924956"], ["updated_at", "2021-10-03 23:24:40.924956"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "inactive"], ["updated_at", "2021-10-05 06:01:24.589835"], ["id", 1]]